
/* 記事用テンプレートコード

with (document) {
    write('<h3>' + '記事タイトル' + '</h3>');
    write('<h6>' + 'xxxx年aa月bb日' + '</h6>' + '<br>');
    write(
        '',
        '',
    );
}

*/

with (document) {
    write('<h3>' + 'とりあえずGitHubPagesでホスティングしたー' + '</h3>');
    write('<h6>' + '2020年12月16日' + '</h6>' + '<br>');
    write(
        '<p>ども( ・∇・)。Yutolab1120です！とりあえずGitHubのコード編集で記事書いてますw</p>',
        '<p>なんかねーwもう少ししっかりバック側作った方がいいね...(記事投稿フォーム的なやつ欲しいw)</p>',
        '<p>結局VS Codeとかで書いたやつcommitしたほうが効率いいかもしれんな...</p>',
        '<p>まあ、この記事書いてる時間帯がPM11:18ということでちょっとネムネム...</p>',
        '<p>でも、いつもこんな感じなんだよなーradiko聴きながらコード書くのが最近の日課。</p>',
        '<p>というか、最近忙しすぎて自分の余裕がなくて辛い。これは本当に。もう少し余裕のある生活がしたいです...(切実)</p>',
        '<p>こんなこと書いても意味ないなw</p>' + '<br>',
        '<h5><b>今後の予定</b></h5>',
        '<p>今後は、まず記事をもう少し簡単に投稿できる工夫（？）をしたいですねw</p>',
        '<p>あと、ホスティングサービスも変えたいなと思っています。</p>',
        '<p>予定ではNetlifyとかかな...まあ、その時の気分で考えますw今日はここまでで！また明日！</p>' + '<br>'
    );
} 

with (document) {
    write ('<h3>' + 'Hello,World!' + '</h3>');
    write ('<h6>' + '2020年12月15日' + '</h6>' + '<br>');
    write (
        '<p>こんにちは。ブログ投稿、運営をはじめました！ユウトです！</p>',
        '<p>このブログはCMSを使用しない非常に更新が大変なブログになります...</p>',
        '<p>まあ、<b>「ある意味」</b>ロマンがあって良いのではないかなと思いますw&nbsp;いつまで続けられるかな....</p>',
        '<p>頑張って更新していきたいと思います！</p>' + '<br>',
        '<h5><b>サブ見出しはh5タグで書こうかな...</b></h5>',
        '<p>それとも、CSSで自作のタグを作ろうかな...</p>',
        '<p>正直ね ？ CMSを使わないってことはカスタマイズが最高にしやすい訳です。</p>',
        '<p>実はこの記事（？）はローカル環境のVS Codeで書いてますw&nbsp;いやー本当に、、、ホスティングはどこにしようかなー</p>',
        '<p>そんな感じですが、まあよろしくお願いしますー！</p>'
    );
}
