
/* 記事用テンプレートコード

with (document) {
    write('<h3>' + '記事タイトル' + '</h3>');
    write('<h6>' + 'xxxx年aa月bb日' + '</h6>' + '<br>');
    write(
        '',
        '',
    );
}

*/

with (document) {
    write('<h3>' + 'メディアは嘘！？ トランプさんの反撃開始...!' + '</h3>');
    write('<h6>' + '2021年01月16日' + '</h6>' + '<br>');
    write(
        '<p>こんにちは！@YUtolab1120です。</p>',
        '<blockquote class="twitter-tweet"><p lang="ja" dir="ltr">コ〇ナよりもマスメディアの方が数万倍は有毒なウイルスですよね<br><br>弱毒性のコ💩ナで恐怖を煽ったり、日本人を分断し、<br><br>国力を低下させたり、デマで国民を騙したり<br><br>世界的な犯罪者集団を支持し、逆にトランプを批判したりといった、このメディアウイルスこそが最も有害です<br><br>全日本人が気づくべきです <a href="https://t.co/5XzrsoNOQ6">pic.twitter.com/5XzrsoNOQ6</a></p>&mdash; マッカーサーJr (@realmaccarsarjr) <a href="https://twitter.com/realmaccarsarjr/status/1350368420496240640?ref_src=twsrc%5Etfw">January 16, 2021</a></blockquote> <script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>',
        '<p>最近。こんな感じのツイートが多くされていることご存知ですか？</p>',
        '<p>個人的に興味深いなと思い、今回記事にさせていただきました。</p>' + '<br>',
        '<h5><b>#トランプ反撃開始 について</b></h5>',
        '<p>これについてですねw正直僕も最初は「トランプさんは敵だ」と考えてました。</p>',
        '<p>しかし、このようなツイートなどをきっかけに色々調べてみたところ。メディアでは明かされていない内容が次々に出てきたんです。</p>',
        '<p>なんで、表には出さないのか。「もう、何も信じられない。」そんな状況ですよね....</p>',
        '<p>何やら「全世界緊急放送」や「Parlorがアプリストアから配信停止」だとか、なんかたくさん「ゴム人間」とかも聞きます。</p>',
        '<p>今後、また面白い情報を目にしたら投稿していきますねw</p>',
        '<p>それでは、また会いましょう！！</p>' + '<br>'
    );
}

with (document) {
    write('<h3>' + '明けましておめでとうございます。' + '</h3>');
    write('<h6>' + '2021年01月04日' + '</h6>' + '<br>');
    write(
        '<p>こんにちは。投稿ができてなかった@Yutolab1120です。(普通にごめんなさい...)</p>',
        '<p>気がついたら年が2021年になってましたね...確か、<b>丑年</b>ですよね。</p>',
        '<p>今年も作りたいモノ、沢山あります。ちょっとメモしておきたいと思います。</p>' + '<br>',
        '<h5><b>作りたいアプリ,サービス</b></h5>',
        '<p><b>・インスタントなチャットサイト</b></p>',
        '<p><b>・写真を投稿できるアプリ</b></p>',
        '<p><b>・クエスト投稿サイト(お題箱みたいなもの)</b></p>',
        '<p><b>・天気予報とかニュースとかがパッとわかるWebページ</b></p>',
        '<p><b>・iOSのtodoアプリ</b></p>',
        '<p><b>・iOSのタイマーアプリ(ちょっと高機能な)</b></p>' + '<br>',
        '<h5><b>最後に</b></h5>',
        '<p>これで以上ですけど、多分また投稿を休むかもしれません。</p>',
        '<p>なので、そこのところはご了承ください。さよならー！</p>' + '<br>'
    );
}

with (document) {
    write('<h3>' + '日付を自動化したい話' + '</h3>');
    write('<h6>' + '2020年12月17日' + '</h6>' + '<br>');
    write(
        '<p>こんにちは！家に帰ってきて眠すぎてヤバかった@Yutolab1120です。</p>',
        '<p>今日は、とりあえず何か自動化したいなと思いまして。この記事を書いてみていますw</p>' + '<br>',
        '<h5><b>日付の自動化</b></h5>',
        '<p>このブログでまず一番簡単に自動化したいのが<b>「日付」</b>です！</p>',
        '<p>正直ね...いちいちxxxx年aa月bb日って書き換えるのめんどくさいんですよね...</p>',
        '<p>なので。できればこれもJavaScriptでどうにかしたいなと思いました。</p>' + '<br>',
        '<h5><b>じゃあどうやって実装するか？</b></h5>',
        '<p>JavaScriptでの日付追加...これは、まあ<b>new Date()</b>で行けるかな...</p>',
        '<p>var dt = new Date();みたいにして...</p>',
        '<p>var year = dt.getFullYear();のように抽出してくっ付ければいけば実装完了ですねw(意外と簡単...)</p>',
        '<p>こんな感じでした！次の記事では何を実装しようかな...</p>',
        '<p>結構記事書くのも慣れてきたので、これからも頑張っていきたいと思います。</p>',
        '<p>それじゃあ。また明日！</p>' + '<br>'  
    );
}

with (document) {
    write('<h3>' + 'とりあえずGitHubPagesでホスティングしたー' + '</h3>');
    write('<h6>' + '2020年12月16日' + '</h6>' + '<br>');
    write(
        '<p>ども( ・∇・)。Yutolab1120です！とりあえずGitHubのコード編集で記事書いてますw</p>',
        '<p>なんかねーwもう少ししっかりバック側作った方がいいね...(記事投稿フォーム的なやつ欲しいw)</p>',
        '<p>結局VS Codeとかで書いたやつcommitしたほうが効率いいかもしれんな...</p>',
        '<p>まあ、この記事書いてる時間帯がPM11:18ということでちょっとネムネム...</p>',
        '<p>でも、いつもこんな感じなんだよなーradiko聴きながらコード書くのが最近の日課。</p>',
        '<p>というか、最近忙しすぎて自分の余裕がなくて辛い。これは本当に。もう少し余裕のある生活がしたいです...(切実)</p>',
        '<p>こんなこと書いても意味ないなw</p>' + '<br>',
        '<h5><b>今後の予定</b></h5>',
        '<p>今後は、まず記事をもう少し簡単に投稿できる工夫（？）をしたいですねw</p>',
        '<p>あと、ホスティングサービスも変えたいなと思っています。</p>',
        '<p>予定ではNetlifyとかかな...まあ、その時の気分で考えますw今日はここまでで！また明日！</p>' + '<br>'
    );
} 

with (document) {
    write ('<h3>' + 'Hello,World!' + '</h3>');
    write ('<h6>' + '2020年12月15日' + '</h6>' + '<br>');
    write (
        '<p>こんにちは。ブログ投稿、運営をはじめました！ユウトです！</p>',
        '<p>このブログはCMSを使用しない非常に更新が大変なブログになります...</p>',
        '<p>まあ、<b>「ある意味」</b>ロマンがあって良いのではないかなと思いますw&nbsp;いつまで続けられるかな....</p>',
        '<p>頑張って更新していきたいと思います！</p>' + '<br>',
        '<h5><b>サブ見出しはh5タグで書こうかな...</b></h5>',
        '<p>それとも、CSSで自作のタグを作ろうかな...</p>',
        '<p>正直ね ？ CMSを使わないってことはカスタマイズが最高にしやすい訳です。</p>',
        '<p>実はこの記事（？）はローカル環境のVS Codeで書いてますw&nbsp;いやー本当に、、、ホスティングはどこにしようかなー</p>',
        '<p>そんな感じですが、まあよろしくお願いしますー！</p>'
    );
}
